read_verilog cpu.v alu32.v decoder.v regfile.v biu.v PMP_interface.v PMP.v PMM.v
synth_xilinx -top cpu
write_verilog cpu_synth.v

